public/test.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-20 Tue 22:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Testing the Compline Book Theme</title>
<meta name="author" content="Your Name" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/style.css" type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<header>
                          <nav class='breadcrumb'>
                            <a href='/index.html'>Home</a>
                            <span class='breadcrumb-sep'>/</span>
                            <span class='breadcrumb-current'>Testing the Compline Book Theme</span>
                          </nav>
                          <button class='theme-toggle'>Dark / Light</button>
                        </header>
</div>
<div id="content" class="content">
<h1 class="title">Testing the Compline Book Theme</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgafa161b">Introduction</a>
<ul>
<li><a href="#orgc8770ba">The Philosophy</a></li>
</ul>
</li>
<li><a href="#org1cb0ff4">Technical Setup</a>
<ul>
<li><a href="#org4ed2d2e">Emacs Lisp Code</a></li>
<li><a href="#orga94274b">Styling Details</a></li>
</ul>
</li>
<li><a href="#orgd590c0b">Advanced Features</a>
<ul>
<li><a href="#orgcaddfab">Data Representation</a></li>
<li><a href="#org26e536e">Hidden Implementation</a></li>
</ul>
</li>
<li><a href="#orgf137028">Conclusion</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgafa161b" class="outline-2">
<h2 id="orgafa161b">Introduction</h2>
<div class="outline-text-2" id="text-orgafa161b">
<p>
This is a test document to verify that the CSS layout is working correctly. If the CSS is loaded, you should see "Chapter 1" to the left of this heading.
</p>
</div>
<div id="outline-container-orgc8770ba" class="outline-3">
<h3 id="orgc8770ba">The Philosophy</h3>
<div class="outline-text-3" id="text-orgc8770ba">
<p>
The goal is to combine the aesthetic of a physical book with the dark, muted colors of the <b>Compline</b> Emacs theme.
</p>
</div>
</div>
</div>
<div id="outline-container-org1cb0ff4" class="outline-2">
<h2 id="org1cb0ff4">Technical Setup</h2>
<div class="outline-text-2" id="text-org1cb0ff4">
<p>
This section tests how code blocks and sub-sections appear.
</p>
</div>
<div id="outline-container-org4ed2d2e" class="outline-3">
<h3 id="org4ed2d2e">Emacs Lisp Code</h3>
<div class="outline-text-3" id="text-org4ed2d2e">
<p>
Here is a snippet of the configuration used to build this site. It should appear inside a dark box with a dotted left border.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(defun my/org-publish-success ()
  (message "The book theme has been applied!"))
</pre>
</div>
</div>
</div>
<div id="outline-container-orga94274b" class="outline-3">
<h3 id="orga94274b">Styling Details</h3>
<div class="outline-text-3" id="text-orga94274b">
<ul class="org-ul">
<li><b>Bold text</b> for emphasis.</li>
<li><i>Italic text</i> for definitions.</li>
<li><code>Monospace</code> for inline variables.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd590c0b" class="outline-2">
<h2 id="orgd590c0b">Advanced Features</h2>
<div class="outline-text-2" id="text-orgd590c0b">
<p>
This section tests tables and folding details.
</p>
</div>
<div id="outline-container-orgcaddfab" class="outline-3">
<h3 id="orgcaddfab">Data Representation</h3>
<div class="outline-text-3" id="text-orgcaddfab">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Feature</th>
<th scope="col" class="org-left">Status</th>
<th scope="col" class="org-left">Color Code</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Background</td>
<td class="org-left">Working</td>
<td class="org-left">#1a1d21</td>
</tr>

<tr>
<td class="org-left">Header Accent</td>
<td class="org-left">Testing</td>
<td class="org-left">#4d6b6b</td>
</tr>

<tr>
<td class="org-left">Link Visibility</td>
<td class="org-left">Pending</td>
<td class="org-left">#5a6b7a</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org26e536e" class="outline-3">
<h3 id="org26e536e">Hidden Implementation</h3>
<div class="outline-text-3" id="text-org26e536e">
<div class="details" id="orgf83ec70">
<div class="summary" id="orgd1fc9dd">
<p>
Technical Metadata
</p>

</div>
<p>
This content is tucked away inside a details tag. It uses the `details` and `summary` CSS selectors we defined to keep the "book" look clean.
</p>

</div>
</div>
</div>
</div>
<div id="outline-container-orgf137028" class="outline-2">
<h2 id="orgf137028">Conclusion</h2>
<div class="outline-text-2" id="text-orgf137028">
<p>
If the text is readable and the margins are wide (centered), the theme is successful.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="footer">Built with Emacs</p>
</div>
</body>
</html>
